<a href="https://colab.research.google.com/github/KYOH95/Database_Studies/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

In [4]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://kakasi18:Kakasi18!1@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

'Connected: kakasi18@dev'

In [5]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel;

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [42]:
%%sql

select *
from raw_data.user_session_channel
limit 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1491, '00029153d12ae1c9abe59c17ff2e0895', 'Organic'),
 (59, '0002ac0d783338cfeab0b2bdbd872cda', 'Naver'),
 (117, '0006246bee639c7a7b11a08e34dd3cc6', 'Youtube'),
 (572, '0006dd05ea1e999ddaa041a7091b7b36', 'Organic'),
 (935, '0007cda84fafdcf42f96c4f4adb7f8ce', 'Google'),
 (1363, '000a91f3e374e6147d58ed1814247508', 'Naver'),
 (780, '000c076c390a4c357313fca29e390ece', 'Naver'),
 (1917, '000d0c74074191add6f22e0004db8f76', 'Organic'),
 (1357, '000d54aadcedee0739d39127955f2cdb', 'Instagram'),
 (1247, '000dd3543ac84d906eae52e7c779bb2a', 'Naver')]

In [14]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000)),
 ('0004289ee1c7b8b08c77e19878106ae3', datetime.datetime(2019, 11, 16, 21, 20, 14, 447000)),
 ('0006246bee639c7a7b11a08e34dd3cc6', datetime.datetime(2019, 8, 10, 16, 33, 14, 980000)),
 ('0006dd05ea1e999ddaa041a7091b7b36', datetime.datetime(2019, 7, 6, 19, 54, 15, 83000)),
 ('000958fdaefe0dd06f5d7c4e4a5f28d1', datetime.datetime(2019, 11, 2, 14, 52, 30, 183000)),
 ('000a3f777828d2cdbee98887561aa130', datetime.datetime(2019, 11, 29, 16, 33, 55)),
 ('000a91f3e374e6147d58ed1814247508', datetime.datetime(2019, 7, 17, 14, 24, 16, 880000)),
 ('000cb7efa8a05429dd5309b4bea2eb0c', datetime.datetime(2019, 7, 23, 13, 39, 28)),
 ('000d0c74074191add6f22e0004db8f76', datetime.datetime(2019, 8, 21, 14, 48, 36)),
 ('000d54aadcedee0739d39127955f2cdb', datetime.datetime(2019, 9, 21, 21, 16, 29))]

In [46]:
%%sql

SELECT DATE(ts), COUNT(sessionid)
FROM raw_data.session_timestamp
GROUP by 1
ORDER by 1
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [43]:
%%sql

SELECT DATE(st.ts), COUNT(usc.userid)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON usc.sessionid = st.sessionid
GROUP by 1
ORDER by 1
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [49]:
%%sql

SELECT DATE(st.ts), COUNT(DISTINCT usc.userid)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON usc.sessionid = st.sessionid
GROUP by 1
ORDER by 1
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 119),
 (datetime.date(2019, 5, 2), 127),
 (datetime.date(2019, 5, 3), 130),
 (datetime.date(2019, 5, 4), 122),
 (datetime.date(2019, 5, 5), 124),
 (datetime.date(2019, 5, 6), 133),
 (datetime.date(2019, 5, 7), 147),
 (datetime.date(2019, 5, 8), 135),
 (datetime.date(2019, 5, 9), 145),
 (datetime.date(2019, 5, 10), 144)]

In [79]:
%%sql

SELECT EXTRACT(YEAR FROM st.ts) || '-' || EXTRACT(MONTH FROM st.ts) YEARMONTH, COUNT(DISTINCT usc.userid)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON usc.sessionid = st.sessionid
GROUP BY 1
ORDER BY 1 DESC
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-9', 639),
 ('2019-8', 662),
 ('2019-7', 623),
 ('2019-6', 459),
 ('2019-5', 281),
 ('2019-11', 721),
 ('2019-10', 763)]

In [84]:
%%sql

SELECT TO_CHAR(st.ts, 'yyyy-mm') YEARMONTH, COUNT(DISTINCT usc.userid)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON usc.sessionid = st.sessionid
GROUP BY 1
ORDER BY 1
LIMIT 10

   postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 281),
 ('2019-06', 459),
 ('2019-07', 623),
 ('2019-08', 662),
 ('2019-09', 639),
 ('2019-10', 763),
 ('2019-11', 721)]